IvanovDmitriy09/Eclipse_templates/Artery/AT32F421/system/src/cmsis/vectors_at32f421.c
/*
 * This file is part of the µOS++ distribution.
 *   (https://github.com/micro-os-plus)
 * Copyright (c) 2014 Liviu Ionescu.
 *
 * Permission is hereby granted, free of charge, to any person
 * obtaining a copy of this software and associated documentation
 * files (the "Software"), to deal in the Software without
 * restriction, including without limitation the rights to use,
 * copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom
 * the Software is furnished to do so, subject to the following
 * conditions:
 *
 * The above copyright notice and this permission notice shall be
 * included in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
 * NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT
 * HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
 * WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 */

// ----------------------------------------------------------------------------

#include "cortexm/exception-handlers.h"

// ----------------------------------------------------------------------------

void __attribute__((weak))
Default_Handler(void);

// Forward declaration of the specific IRQ handlers. These are aliased
// to the Default_Handler, which is a 'forever' loop. When the application
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//
void __attribute__ ((weak, alias ("Default_Handler")))
WWDT_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
PVM_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
ERTC_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
FLASH_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
CRM_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXINT1_0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXINT3_2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXINT15_4_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA1_Channel1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA1_Channel3_2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA1_Channel5_4_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
ADC1_CMP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TMR1_BRK_OVF_TRG_HALL_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TMR1_CH_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TMR3_GLOBAL_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TMR6_GLOBAL_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TMR14_GLOBAL_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TMR15_GLOBAL_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TMR16_GLOBAL_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TMR17_GLOBAL_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C1_EVT_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C2_EVT_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SPI1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SPI2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USART1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USART2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C1_ERR_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C2_ERR_IRQHandler(void);

// ----------------------------------------------------------------------------

extern unsigned int _estack;

typedef void
(* const pHandler)(void);

// ----------------------------------------------------------------------------

// The vector table.
// This relies on the linker script to place at correct location in memory.

__attribute__ ((section(".isr_vector"),used))
pHandler __isr_vectors[] =
  { //
    (pHandler) &_estack,                          // The initial stack pointer
        Reset_Handler,                            // The reset handler

        NMI_Handler,                              // The NMI handler
        HardFault_Handler,                        // The hard fault handler

#if defined(__ARM_ARCH_7M__) || defined(__ARM_ARCH_7EM__)
        MemManage_Handler,                        // The MPU fault handler
        BusFault_Handler,// The bus fault handler
        UsageFault_Handler,// The usage fault handler
#else
        0, 0, 0,				  // Reserved
#endif
        0,                                        // Reserved
        0,                                        // Reserved
        0,                                        // Reserved
        0,                                        // Reserved
        SVC_Handler,                              // SVCall handler
#if defined(__ARM_ARCH_7M__) || defined(__ARM_ARCH_7EM__)
        DebugMon_Handler,                         // Debug monitor handler
#else
        0,					  // Reserved
#endif
        0,                                        // Reserved
        PendSV_Handler,                           // The PendSV handler
        SysTick_Handler,                          // The SysTick handler

        // ----------------------------------------------------------------------
        // at32f421 vectors
        WWDT_IRQHandler,                     // Window Watchdog Timer
        PVM_IRQHandler,                      // PVM through EXINT Line detect
        ERTC_IRQHandler,                     // ERTC
        FLASH_IRQHandler,                    // Flash
        CRM_IRQHandler,                      // CRM
        EXINT1_0_IRQHandler,                 // EXINT Line 1 & 0,
        EXINT3_2_IRQHandler,                 // EXINT Line 3 & 2
        EXINT15_4_IRQHandler,                // EXINT Line 15 ~ 4
        0,                                   // Reserved
        DMA1_Channel1_IRQHandler,            // DMA1 Channel 1
        DMA1_Channel3_2_IRQHandler,          // DMA1 Channel 3 & 2
        DMA1_Channel5_4_IRQHandler,          // DMA1 Channel 5 & 4
        ADC1_CMP_IRQHandler,                 // ADC1 & Comparator
        TMR1_BRK_OVF_TRG_HALL_IRQHandler,    // TMR1 brake overflow trigger and hall
        TMR1_CH_IRQHandler,                  // TMR1 channel
        0,                                   // Reserved
        TMR3_GLOBAL_IRQHandler,              // TMR3
        TMR6_GLOBAL_IRQHandler,              // TMR6
        0,                                   // Reserved
        TMR14_GLOBAL_IRQHandler,             // TMR14
        TMR15_GLOBAL_IRQHandler,             // TMR15
        TMR16_GLOBAL_IRQHandler,             // TMR16
        TMR17_GLOBAL_IRQHandler,             // TMR17
        I2C1_EVT_IRQHandler,                 // I2C1 Event
        I2C2_EVT_IRQHandler,                 // I2C2 Event
        SPI1_IRQHandler,                     // SPI1
        SPI2_IRQHandler,                     // SPI2
        USART1_IRQHandler,                   // USART1
        USART2_IRQHandler,                   // USART2
        0,                                   // Reserved
        0,                                   // Reserved
        0,                                   // Reserved
        I2C1_ERR_IRQHandler,                 // I2C1 Error
        0,                                   // Reserved
        I2C2_ERR_IRQHandler,                 // I2C2 Error
    };

// ----------------------------------------------------------------------------

// Processor ends up here if an unexpected interrupt occurs or a specific
// handler is not present in the application code.

void __attribute__ ((section(".after_vectors")))
Default_Handler(void)
{
  while (1)
    {
	  ;
    }
}

// ----------------------------------------------------------------------------
